<a href="https://akademie.datamics.com/kursliste/">![title](bg_datamics_top.png)</a>

<center><em>© Datamics</em></center><br><center><em>Besuche uns für mehr Informationen auf <a href='https://akademie.datamics.com/kursliste/'>www.akademie.datamics.com</a></em></center>

# Pandas Übung - Aufgabe

Es ist Zeit deine neuen Pandas Skills zu testen! Nutze dazu die  bereitgestellte `csv`-Datei in diesem Ordner. Bitte folge darüber hinaus den **fett** geschriebenen Anweisungen und führe den entsprechenden Code aus.

*Hinweis: Alle Aufgaben sollten in einer Zeile Pandas-Code gelöst werden. Du hast Schwierigkeiten damit? Kein Problem! Wirf einfach einen kurzen Blick in das Lösungs-Notebook oder -Video!*

**Importiere Pandas und lese die `banklist.csv` Datei ein einen Dataframe namens "banks" ein.**

**Zeige den `head` des Dataframe an.**

In [3]:
# Dein Code hier

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

**Wie lauten die Spaltennamen?**

In [ ]:
# Dein Code hier

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

**Wie viele Staaten (en. states -> `ST`) sind in diesem Datensatz vertreten?**

In [ ]:
# Dein Code hier

44

**Erstelle eine Liste oder ein Array der einzigartigen (en. unique) Staaten im Datensatz.**

In [ ]:
# Dein Code hier

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

**Was sind die 5 Staaten mit den meisten gescheiterten (en. failed) Banken?**

In [8]:
# Dein Code hier

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

**Was sind die Top 5 der akquirierenden Institutionen (-> `Acquiring Institution`)?**

In [ ]:
# Dein Code hier

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

**Wie viele Banken hat die "State Bank of Texas" aquiriert?**

*Bonus: Achte darauf, wie viele davon in Texas sitzen.*

In [ ]:
# Dein Code hier

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

**In welcher Stadt aus Kalifornien (en. california) sind die meisten Banken gescheitert?**

*Hinweis: der Staat-Code lautet `CA`.*

In [12]:
# Dein Code hier

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

**Wie viele der gescheiterten Banken tragen nicht "Bank" im Namen?**

In [14]:
# Dein Code hier

14

**Wie viele Banknamen starten mit dem Buchstaben "s"?**

In [ ]:
# Dein Code hier

53

**Wie viele der `CERT` Werte liegen über 20.000?**

In [17]:
# Dein Code hier

417

**Wie viele Banknamen bestehen aus lediglich zwei Wörtern (z.B. "First Bank" oder "Bank Georgia")?**

In [20]:
# Dein Code hier

114

**Bonus: Wie viele Banken haben im Jahr 2008 geschlossen?**

*Hinweis: Das ist etwas schwerer, da wir uns noch nicht mit Zeitreihen in Pandas beschäftigt haben. Einen Versuch ist es aber trotzdem Wert :)*

In [21]:
# Dein Code hier

25

# Gut gemacht!